{
  "heading": "Coolie No. 1 - This Movie Makes Us Work Hard To Complete The Movie",
  "subHeading": "This movie makes us forget that the year is 2020 and the movie goers' brains has stopped growing since 1995.",
  "publishedDate": "26th December, 2020",
  "author": "Akash",
  "readTime": "3 minutes",
  "heroImage": "https://static.toiimg.com/thumb/msid-71389046,width-800,height-600,resizemode-75,imgsize-308806,pt-32,y_pad-40/71389046.jpg",
  "basicDetails": {
    "director": "David Dhawan",
    "cast": ["Varun Dhawan", "Sara Ali Khan", "Paresh Rawal"],
    "streamingOn": ["Amazon Prime Video"]
  },
  "reviewContent": [
    "The existential coolie in me is happy because I now carry the burden of my past. The innocent Gujarati child in 1995 – who forced his mother to make spicy bhel puri after his cravings were triggered by Govinda and Karishma Kapoor finding amorous metaphors in Mumbai street-food – had absolutely no idea that 25 years later he’d be waking up on Christmas morning of the darkest year in modern history to review Coolie No. 1, lose his appetite and wonder how Santa Claus eats sev-puri without soiling that glorious beard. This is the cruellest form of time-travel: Everything has changed and nothing has changed. While it’s mighty philanthropic of director David Dhawan to make us forget that the year is 2020, it’s also misanthropic to make us forget that the human mind has evolved in the last 25 years. Between Judwaa 2 and this one, it’s hard to imagine a less productive way of making movies.", 
    "After being insulted by a rich businessman named Rosario, Pandit Jai Kishen teaches him a lesson by getting his daughter married to Raju - a Coolie posing as a millionaire. Soon Raju’s real indentity is exposed but he cooks up a story of having a filthy rich twin. One lie leads to another and things start to go out of hand.", 
    "After being insulted by a rich businessman, pandit Jai Kishen teaches him a lesson by getting his daughter married to Raju, a coolie posing as a millionaire. Coolie No.1 Full Comedy Sara Ali Khan ka acting Baught hi MST hai Varun Dhawan ka bhi acting Baught hi accha first time Coolie bana hai Varun Dhawan Song r good", 
    "This movie gotta be a hit..I AM NOT AGAINST or with NEPOTISM..We must support SSR but that doesnt mean u have to boycott others...If u dont wanna watch the movie dont..why spreading the hate..Varun has nothing to do with Nepo.Varun was a friend of SSR..And SSR would nevr want something like this..that because of him and Nepo.many actors lost their career...And for the ones who says varun is overacting or words like that..Are you even enough?..U wanna judge VD's acting..first go watch October and Badlapur.even aftr watching these movie,u complain his acting..u should go to docter and have a chek up.... We want justice for SSR but not by boycotting Alia,Varun,Sara  etc.I have been waiting for this movie for like nearly 2yr..This movie is gonna be a hit...most people r gonna avoid a hard work of VD and many more just because he is a star kid..what happnd if he is a star kid..he came up with his own hard work..There r billions of fan not just in FB Insta and twittr there r many more Varuniacs..And I am sure Varuniacs will support VD no mattr what othrs think..Varun is really humble and very kind and fun person..he really behavs humbly towards the fans.as many actors behave not politeley to the fans..I am 100%sure Varuniacs are not just fan of his movies dancing etc. His personality really is very good and He is very HARD WORKING..He is one of the most hard working Actors I have evr known.."],
  "youtubeLinks": [
    {"trailer": "https://www.youtube.com/embed/XaZ7jAPdecc"}
  ],
  "relatedReviews": [
    {
      "title": "Asuran - A blood trenching thriller that boils your blood as well",
      "imgUrl": "https://1.bp.blogspot.com/-Y8t4AHMry8E/XdYyDSP2tPI/AAAAAAAAB0Y/ZUG_v8xyzQQb5aqHK-dhB410aTeD1VP8gCLcBGAsYHQ/s1600/asuran-movie-50-day-poster.jpg", 
      "date": "26th December, 2020"
    },
    {
      "title": "Oru pakka kadhai - An average movie for average people in a simple tone", 
      "imgUrl": "https://www.sify.com/uploads/orupakka_umxhlQhhdgaaj.jpeg", 
      "date": "26th December, 2020"
    },
    {
      "title": "Soorarai Potru - Semi-autobiographical flight takes a notch few in the sky", 
      "imgUrl": "https://www.filmibeat.com/ph-big/2020/01/soorarai-pottru_157845859510.jpg", 
      "date": "2nd November, 2020"
    },
    {
      "title": "Mookuthi Amman - Nayanthara and RJ balaji duo scores high in this family-cum-social drama", 
      "imgUrl": "https://a10.gaanacdn.com/images/albums/94/3502394/crop_480x480_1604730273_3502394.jpg", 
      "date": "26th November, 2020"
    }
  ],
  "socialTags": [
    {
      "media": "twitter", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    },
    {
      "media": "twitter", 
      "url": "https://twitter.com/Varun_dvn",
      "content": "@Varun_dvn"
    },
    {
      "media": "twitter", 
      "url": "https://twitter.com/PrimeVideoIN/status/1342729642579357696",
      "content": "@PrimeVideoIN"
    },
    {
      "media": "facebook", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    },
    {
      "media": "youtube", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    },
    {
      "media": "youtube", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    },
    {
      "media": "instagram", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    },
    {
      "media": "instagram", 
      "url": "https://twitter.com/hashtag/CoolieNo1",
      "content": "#CoolieNo1"
    }
  ],
  "movieGallery": [
    "https://static.langimg.com/thumb/msid-79460420,imgsize-143458,width-540,height-405,resizemode-75/navbharat-times.jpg",
    "https://www.thehindu.com/entertainment/movies/angk96/article32811450.ece/ALTERNATES/LANDSCAPE_615/Coolie-No-1",
    "https://filmfare.wwmindia.com/content/2020/nov/thumbnail-coolie-mo11606559551.jpg",
    "https://aniportalimages.s3.amazonaws.com/media/details/coolie_postraug19.jpg"
  ]
}